{
  "title": "Terms and Conditions",
  "effectiveDate": "2024-10-18",
  "sections": [
    {
      "title": "Acceptance of Terms",
      "content": [
        "By using the Website, you agree to these Terms. If you do not agree, please do not use the Website."
      ]
    },
    {
      "title": "User Accounts",
      "content": [
        "To use certain features of the Website, you must create an account. You are responsible for maintaining the confidentiality of your account information and for all activities that occur under your account."
      ]
    },
    {
      "title": "Use of the Website",
      "content": [
        "You agree to use the Website for lawful purposes only. You may not:",
        "Violate any laws or regulations.",
        "Submit false or misleading information.",
        "Use the Website to harm or exploit others."
      ]
    },
    {
      "title": "Intellectual Property",
      "content": [
        "All content on the Website, including but not limited to text, graphics, logos, and code, is the property of CompCode and is protected by copyright and other intellectual property laws. You may not use any content from the Website without our prior written permission."
      ]
    },
    {
      "title": "Subscriptions and Payments",
      "content": [
        "If you choose to subscribe to premium services on the Website, you agree to provide accurate and complete payment information. All fees are non-refundable unless otherwise stated."
      ]
    },
    {
      "title": "User-Generated Content",
      "content": [
        "By submitting content to the Website (e.g., LeetCode problems, company names, etc.), you grant CompCode a non-exclusive, royalty-free, perpetual, and worldwide license to use, display, and modify such content."
      ]
    },
    {
      "title": "Termination",
      "content": [
        "We reserve the right to suspend or terminate your account or access to the Website at our sole discretion, without notice, if you violate these Terms."
      ]
    },
    {
      "title": "Disclaimer of Warranties",
      "content": [
        "The Website is provided \"as is\" and without any warranties, express or implied. We do not guarantee that the Website will be available, secure, or error-free at all times."
      ]
    },
    {
      "title": "Limitation of Liability",
      "content": [
        "To the fullest extent permitted by law, CompCode shall not be liable for any indirect, incidental, or consequential damages arising out of your use of the Website."
      ]
    },
    {
      "title": "Governing Law",
      "content": [
        "These Terms are governed by and construed in accordance with the laws of Canada, without regard to its conflict of laws principles."
      ]
    },
    {
      "title": "Changes to These Terms",
      "content": [
        "We may update these Terms from time to time. Any changes will be posted on this page, and the \"Effective Date\" will be updated."
      ]
    },
    {
      "title": "Contact Information",
      "content": [
        "If you have any questions about these Terms, please contact us at support email below."
      ]
    }
  ]
}
